app/controllers/admin_masters_controller.rb

	def index
		@adminmasters = AdminMaster.all
---
SELECT "admin_masters".* FROM "admin_masters"

	def show
		@adminmaster = AdminMaster.find(:userid =>["userid=?", userid])
---
SELECT "admin_masters".* FROM "admin_masters" WHERE "admin_masters"."id" = ? LIMIT 1  [["id", "index"]]